# Taps
tap 'dteoh/sqa'
tap 'caskroom/cask'
tap 'homebrew/bundle'

# Command line applications
# Core
brew 'coreutils'
brew 'git'
brew 'grep'
brew 'mackup'
brew 'mas'
brew 'trash'
brew 'zsh'

# Development
brew 'hugo'
brew 'python3'

# GUI applications
cask '1password'
cask 'alfred'
cask 'caffeine'
cask 'cheatsheet'
cask 'dash'
cask 'discord'
cask 'dropbox'
cask 'firefox'
cask 'flux'
cask 'google-chrome'
cask 'intellij-idea'
cask 'iterm2'
cask 'microsoft-office'
cask 'sketch'
cask 'slack'
cask 'spectacle'
cask 'spotify'
cask 'sublime-text'
cask 'timing'
cask 'veracrypt'
cask 'ynab'

# Mac App Store
mas 'SnippetsLab', id: t1006087419
mas 'Notability', id: 736189492
mas 'GarageBand', id: 682658836
mas 'iMovie', id: 408981434
mas 'Xcode', id: 497799835
mas 'PiPifier', id: 1160374471
mas Keynote, id: 409183694
mas Pages, id: 409201541
mas iA Writer, id: 775737590
mas 'Day One', id: 1055511498
mas 'Numbers', id: 409203825
