# Taps
tap 'caskroom/cask'
tap 'homebrew/bundle'

# Command line applications
# Core
brew 'coreutils'
brew 'git'
brew 'grep'
brew 'mas'
brew 'trash'
brew 'zsh'

# Development
brew 'hugo'
brew 'python3'
brew 'zsh-syntax-highlighting'

# GUI applications
cask '1password'
cask 'alfred'
cask 'balance-lock'
cask 'dash'
cask 'discord'
cask 'dropbox'
cask 'firefox'
cask 'flux'
cask 'google-chrome'
cask 'intellij-idea'
cask 'iterm2'
cask 'karabiner-elements'
cask 'microsoft-office'
cask 'notion'
cask 'rectangle'
cask 'sequel-pro'
cask 'sketch'
cask 'slack'
cask 'spectacle'
cask 'spotify'
cask 'sublime-text'
cask 'timing'
cask 'visual-studio-code'
cask 'veracrypt'
cask 'ynab'
cask 'zsa-wally'

# Mac App Store
mas 'SnippetsLab', id: 1006087419
mas 'Notability', id: 360593530
mas 'Xcode', id: 497799835
mas 'iA Writer', id: 775737590
mas 'Day One', id: 1055511498
mas 'Monodraw', id: 920404675

