# Command line applications
# Core
brew "coreutils"
brew "git"
brew "git-extras"
brew "grep"
brew "mas"
brew "rbenv"
brew "trash"
brew "zsh"

# GUI applications
cask "1password"
cask "alacritty"
cask "alfred"
cask "balance-lock"
cask "claude"
cask "firefox"
cask "flux"
cask "google-chrome"
cask "karabiner-elements"
cask "obsidian"
cask "rectangle"
cask "spotify"
cask "sublime-text"
cask "visual-studio-code"
cask "zed"
cask "zoom"

# Mac App Store
mas "Monodraw", id: 920404675
mas "SnippetsLab", id: 1006087419
mas "Xcode", id: 497799835

